; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?drone - drone ?arm - arm ?crate - crate)
    (empty-arm ?drone - drone ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?drone ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (not (empty-arm ?drone ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (content-crate ?content ?crate)          
    )
    :effect (and 
        (not (has-crate-drone-arm ?drone ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?drone ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l5_p5_c5_g5_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(empty-arm drone1 left)
	(empty-arm drone1 right)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate medicine crate3)
	(content-crate medicine crate4)
	(content-crate medicine crate5)
	(person-at person1 loc2)
	(person-at person2 loc5)
	(person-at person3 loc3)
	(person-at person4 loc1)
	(person-at person5 loc1)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person1 medicine)
	(has-content-person person2 medicine)
	(has-content-person person4 medicine)
	(has-content-person person5 food)
))
)

; plan
1. (pick-up-crate crate3 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate3 depot)
   added: (has-crate-drone-arm drone1 left crate3)
   goals met: 1 of 6
2. (pick-up-crate crate2 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate2 depot)
   added: (has-crate-drone-arm drone1 right crate2)
   goals met: 1 of 6
3. (drone-move depot loc1 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc1)
   goals met: 0 of 6
4. (drop-crate loc1 person5 crate2 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate2)
   added: (has-content-person person5 food) (empty-arm drone1 right)
   goals met: 1 of 6
5. (drop-crate loc1 person4 crate3 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate3)
   added: (has-content-person person4 medicine) (empty-arm drone1 left)
   goals met: 2 of 6
6. (drone-move loc1 depot drone1)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 depot)
   goals met: 3 of 6
7. (pick-up-crate crate1 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate1 depot)
   added: (has-crate-drone-arm drone1 left crate1)
   goals met: 3 of 6
8. (pick-up-crate crate4 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate4 depot)
   added: (has-crate-drone-arm drone1 right crate4)
   goals met: 3 of 6
9. (drone-move depot loc2 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc2)
   goals met: 2 of 6
10. (drop-crate loc2 person1 crate1 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate1)
   added: (has-content-person person1 food) (empty-arm drone1 left)
   goals met: 3 of 6
11. (drop-crate loc2 person1 crate4 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate4)
   added: (has-content-person person1 medicine) (empty-arm drone1 right)
   goals met: 4 of 6
12. (drone-move loc2 depot drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 depot)
   goals met: 5 of 6
13. (pick-up-crate crate5 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate5 depot)
   added: (has-crate-drone-arm drone1 left crate5)
   goals met: 5 of 6
14. (drone-move depot loc5 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc5)
   goals met: 4 of 6
15. (drop-crate loc5 person2 crate5 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate5)
   added: (has-content-person person2 medicine) (empty-arm drone1 left)
   goals met: 5 of 6
16. (drone-move loc5 depot drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 depot)
   goals met: 6 of 6
